t = '''Создайте новую пустую базу данных в MySQL. Для этого можно воспользоваться phpMyAdmin или командной строкой клиента MySQL.
В новой базе создайте таблицу Users (пользователи) со следующими полями и типами данных соответственно:
id — int auto increment;
email — varchar;
first_name (имя) — varchar;
last_name (фамилия) — varchar;
age (возраст) — int;
date_created (дата добавления) — datetime.
Создайте PHP-файл User.php, внутри него класс User. В классе User объявите поле $connection и в конструкторе класса инициализируйте подключение к вашей базе данных (указав имя хоста, логин, пароль и имя базы) с помощью PDO. Сохраните подключение в поле $connection. Данное подключение будет использоваться во всех последующих методах класса User.
Опишите метод create для класса User. В качестве входящего параметра он должен принимать ассоциативный массив с полями, необходимыми для добавления записи в таблицу Users. Метод должен выполнять вставку новой записи в таблицу Users с помощью PDO. Используйте SQL-запрос INSERT.
Опишите метод update для класса User. В качестве входящего параметра он должен принимать ассоциативный массив с полями, необходимыми для добавления записи в таблицу Users, а также id записи. Метод должен выполнять обновление существующей записи в таблице Users с помощью PDO. Используйте SQL-запрос UPDATE.
Опишите метод delete для класса User. В качестве входящего параметра он должен принимать id записи. Метод должен выполнять удаление существующей записи из таблицы Users с помощью PDO. Используйте SQL-запрос DELETE.
Опишите метод list для класса User. Он не принимает никаких параметров, а выводит все записи таблицы Users. Используйте PDO и запрос SELECT.
Создайте новый файл index.php и подключите к нему User.php.
Реализуйте вёрстку таблицы для вывода списка пользователей. Каждая строка таблицы должна соответствовать одной записи из базы данных. Все поля выводите в контролах input text. Добавьте колонку справа с кнопками edit (для сохранения изменённой записи) и delete (для удаления). Чтобы динамически вывести все записи, используйте метод list класса User и цикл foreach. Поместите код в начало файла index.php.
Под таблицей реализуйте форму для добавления пользователя.
После кода формы реализуйте серверную логику обработки действий по добавлению, изменению и удалению записи на PHP (отделите PHP-код тегами <?php ?>).
Ваша форма, а также ссылки кнопок должны вести на файл index.php.
В зависимости от выбранного действия вызовите соответствующий метод класса User (create, update, delete).
'''

print(len(t))